# 모든 위치는 딕셔너리로 저장할 것
# 입력값에 따라 움직일 손 선택할 것 - 1.b이거나 열이 4이하면 왼손, 아니면 오른손
dict = {'q': [0, 0], 'w': [0, 1], 'e': [0, 2], 'r': [0, 3], 't': [0, 4], 'y': [0, 5]
    , 'u': [0, 6], 'i': [0, 7], 'o': [0, 8], 'p': [0, 9], 'a': [1, 0],
        's': [1, 1], 'd': [1, 2], 'f': [1, 3], 'g': [1, 4], 'h': [1, 5],
        'j': [1, 6], 'k': [1, 7], 'l': [1, 8], 'z': [2, 0], 'x': [2, 1],
        'c': [2, 2], 'v': [2, 3], 'b': [2, 4], 'n': [2, 5], 'm': [2, 6]}
l, r = input().split()
s = input()
tot = 0
for i in s:
    if i != 'b' and dict[i][1] < 5: #왼손
        sum = abs(dict[l][0]-dict[i][0]) + abs(dict[l][1]-dict[i][1])
        l = i
    else:
        sum = abs(dict[r][0] - dict[i][0]) + abs(dict[r][1] - dict[i][1])
        r = i
    tot += (sum+1)
print(tot)